Query for Data from https://console.cloud.google.com/bigquery?project=my-project-75222-gt

SELECT date
FROM `bigquery-public-data.covid19_open_data.covid19_open_data`
WHERE country_name = '<COUNTRY_NAME>'
and date = '2021-04-16'
ORDER BY date desc
LIMIT 16000

In [1]:
import numpy as np
import pandas as pd

In [2]:
Brazil_data = pd.read_csv('Brazil_landl.csv')
India_data = pd.read_csv('India_landl.csv')
Mexico_data = pd.read_csv('Mexico_landl.csv')
UK_data = pd.read_csv('UK_landl.csv')
US_data = pd.read_csv('US_landl.csv')

In [3]:
data_sets = [Brazil_data,India_data,Mexico_data,UK_data,US_data]

In [4]:
# Check for NULL values
for data in data_sets:
    data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5616 entries, 0 to 5615
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       5616 non-null   object
 1   latitude   5612 non-null   float64
 2   longitude  5612 non-null   float64
dtypes: float64(2), object(1)
memory usage: 131.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 749 entries, 0 to 748
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       749 non-null    object
 1   latitude   720 non-null    float64
 2   longitude  720 non-null    float64
dtypes: float64(2), object(1)
memory usage: 17.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2498 entries, 0 to 2497
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       2498 non-null   object
 1   latitude   2110 non-null   float64
 2   longitude  2110 non-null   float64
dtypes: float64(2), object(1)
memory usage: 58.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 197 entries, 0 to 196
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       197 non-null    object
 1   latitude   174 non-null    float64
 2   longitude  174 non-null    float64
dtypes: float64(2), object(1)
memory usage: 4.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3285 entries, 0 to 3284
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       3285 non-null   object
 1   latitude   3282 non-null   float64
 2   longitude  3282 non-null   float64
dtypes: float64(2), object(1)
memory usage: 77.1+ KB

# Drop NULL values

In [5]:
Brazil_data = Brazil_data.dropna(axis = 0, how ='any')
Brazil_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5612 entries, 0 to 5615
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       5612 non-null   object
 1   latitude   5612 non-null   float64
 2   longitude  5612 non-null   float64
dtypes: float64(2), object(1)
memory usage: 175.4+ KB

In [6]:
India_data = India_data.dropna(axis = 0, how ='any')
India_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 748
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       720 non-null    object
 1   latitude   720 non-null    float64
 2   longitude  720 non-null    float64
dtypes: float64(2), object(1)
memory usage: 22.5+ KB

In [7]:
Mexico_data = Mexico_data.dropna(axis = 0, how ='any')
Mexico_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2110 entries, 0 to 2497
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       2110 non-null   object
 1   latitude   2110 non-null   float64
 2   longitude  2110 non-null   float64
dtypes: float64(2), object(1)
memory usage: 65.9+ KB

In [8]:
UK_data = UK_data.dropna(axis = 0, how ='any')
UK_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 174 entries, 0 to 196
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       174 non-null    object
 1   latitude   174 non-null    float64
 2   longitude  174 non-null    float64
dtypes: float64(2), object(1)
memory usage: 5.4+ KB

In [9]:
US_data = US_data.dropna(axis = 0, how ='any')
US_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3282 entries, 0 to 3284
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       3282 non-null   object
 1   latitude   3282 non-null   float64
 2   longitude  3282 non-null   float64
dtypes: float64(2), object(1)
memory usage: 102.6+ KB

# Drop date column

In [11]:
Brazil_data = Brazil_data.drop(['date'], axis=1)
India_data = India_data.drop(['date'], axis=1)
Mexico_data = Mexico_data.drop(['date'], axis=1)
UK_data = UK_data.drop(['date'], axis=1)
US_data = US_data.drop(['date'], axis=1)

# Concat all data together and export to csv

In [12]:
all_lat_long_data = pd.concat([Brazil_data,India_data,Mexico_data,UK_data,US_data])
all_lat_long_data

       latitude  longitude
0     -0.975000 -62.923889
1     -7.432778 -70.022778
2     -3.142778 -58.443889
3     -8.720833 -39.115000
4    -11.616944 -38.800000
...         ...        ...
3280  32.591667 -88.204167
3281  34.683333 -83.750000
3282  33.599243 -83.858729
3283  31.780000 -84.140000
3284  33.580000 -83.170000

[11898 rows x 2 columns]

In [14]:
all_lat_long_data.to_csv('all_lat_long_data.csv', index=False)